{
  "personal": {
    "name": "Bradley S. Isenbek",
    "title": "Architect | Senior Software Developer | Big Data",
    "phone": "616-727-1150",
    "email": "brad@isenbek.io",
    "website": "www.isenbek.io",
    "location": "Grand Rapids, MI"
  },
  "summary": "Insightful Full Stack Developer with over 15 years of experience. Expert in forecasting computing trends and grounded in a comprehensive understanding of technological evolution. Proficiency in various programming languages, frameworks, and cloud computing, including AWS. Known for integrating complex software systems and external device interfaces for real-time web applications.\n\nA strategic big-picture thinker who identifies improvement opportunities and excels as a collaborative team member across multiple departments. Demonstrates strong analytical skills with the agility to drive projects to completion. Adept at thriving in high-pressure, dynamic environments.",
  "experience": [
    {
      "id": "victorytext",
      "title": "Architect and Developer",
      "company": "VictoryText, LLC.",
      "location": "Grand Rapids, MI",
      "startDate": "2022",
      "endDate": "Present",
      "description": "Architect and developer of a high-volume, high-availability messaging platform. I collaborated with a small UI team to bring the product into production within a tight timeline. The platform is now generating revenue.",
      "achievements": [
        "Developed a RESTful API layer using FastAPI to facilitate communication with the platform. This layer enables the platform to communicate with external systems such as Twilio, Bandwidth, Kaleyra, and Telnyx.",
        "I engineered low-level DynamoDB calls for atomic queue operations.",
        "Created a reporting backend for continuous data aggregation of carrier and provider statistics. Data is shipped to QuickSight for visualization."
      ]
    },
    {
      "id": "conservative-connector",
      "title": "Architect and Developer",
      "company": "ConservativeConnector, LLC.",
      "location": "Grand Rapids, MI",
      "startDate": "2020",
      "endDate": "2022",
      "description": "Designed a high-volume ESP data management systems leveraging AWS services.",
      "achievements": [
        "Orchestrated data normalization processes for contacts numbering over one hundred million with billions of emails send yearly.",
        "Integrated contact metadata of over 4.9 billion data points for modeling and discovering connections. The data was renormalized into a usable form.",
        "The platform is integrated with multiple data providers through various channels for data ingestion.",
        "Data is shipped to Snowflake for analysis, segmentation, and dashboards."
      ]
    },
    {
      "id": "transunion",
      "title": "Senior Architect",
      "company": "TransUnion SRG",
      "location": "Boca Raton, FL",
      "startDate": "2014",
      "endDate": "2018",
      "description": "Lead of the search engine team within SRG. Critical backend for a number of large websites, including Whitepages.com.",
      "achievements": [
        "Responsible for a highly available, distributed, secure infrastructure. Hands-on C# coding and the management of a team of five developers.",
        "Worked with sensitive information that required a highly secured environment.",
        "Served as the lead developer on a classified project with the United States Government.",
        "Worked closely with Data Science team in building innovative machine learning models and segmentations for personalization initiatives to drive margin, revenue, and conversion."
      ]
    },
    {
      "id": "nextsource-senior",
      "title": "Senior Architect",
      "company": "NextSource / PeopleTicker",
      "location": "Manhattan, NY",
      "startDate": "2012",
      "endDate": "2014",
      "description": "Talent Acquisition Automation",
      "achievements": [
        "I worked on a global, real-time labor-rate calculator project at PeopleTicker, a spin-off start-up from nextSource. As Senior Data Engineer, I designed data structures and systems for search engine data acquisition, processing, and retrieval.",
        "Designed and developed the rate search engine and algorithms at PeopleTicker. The rate algorithm was implemented in Java using Weka and other statistical packages.",
        "Apache Solr, Amazon AWS using EC2, RDS and other AWS services."
      ]
    },
    {
      "id": "nextsource-app-dev",
      "title": "Application Developer",
      "company": "NextSource",
      "location": "Manhattan, NY",
      "startDate": "2011",
      "endDate": "2012",
      "description": "Talent Acquisition Automation",
      "achievements": [
        "Developer for a Talent Acquisition Management System (TAMS) application for a provider of temporary labor for large corporations, including Capital One, Caterpillar, and BASF. This application was used by human resources to track the life-cycle processes for sourcing talent, hiring, and invoicing.",
        "PHP, Oracle, JavaScript"
      ]
    },
    {
      "id": "linx-communications",
      "title": "Senior Developer",
      "company": "Linx Communications, Inc.",
      "location": "Hauppauge, NY",
      "startDate": "2009",
      "endDate": "2011",
      "description": "Digital Marketing",
      "achievements": [
        "Served as Senior Developer designing and coding eCommerce sites. While in this role, created customer packing algorithm to efficiently fit n number of packages into boxes of m sizes.",
        "Integrated Magento with ERP system utilizing customer bridge connected to Magento API while maintaining and managing all code and production servers.",
        "Twitter API, Magento, Google Analytics"
      ]
    },
    {
      "id": "j-lack",
      "title": "Software Development & System Design",
      "company": "J. Lack Consulting",
      "location": "East Hampton, NY",
      "startDate": "2008",
      "endDate": "2008",
      "description": "Technology Consulting",
      "achievements": [
        "I maintained several production eCommerce servers while running daily mail blasts and analyzing response utilizing Google Analytics. I managed the entire operations of an eCommerce integration project for a popular wine website.",
        "I designed a secure network for a 120-bed healthcare facility. The network was designed to meet HIPAA compliance and protect patient data."
      ]
    },
    {
      "id": "enablepay",
      "title": "Senior Developer",
      "company": "EnablePay, Inc.",
      "location": "Mineola, NY",
      "startDate": "2008",
      "endDate": "2008",
      "description": "Credit Card Processor Startup",
      "achievements": [
        "Created a merchant transaction management system supervising junior developers and ensuring daily credit card transactions were cleared by EDS/banking system.",
        "Developed web-based merchant application in PHP integrating with SugarCRM SOAP"
      ]
    },
    {
      "id": "americorp",
      "title": "Senior Developer",
      "company": "AmeriCorp, Inc.",
      "location": "Syosset, NY",
      "startDate": "2007",
      "endDate": "2008",
      "description": "Debt Consolidation",
      "achievements": [
        "I supported a major project for a financial processing center by integrating and deploying an enterprise-grade Compensation Management System. I developed the financial backend for the system, which receives and disburses client funds to escrow accounts and generates outbound messages based on account status.",
        "Developed plan for installing 500-seat call center utilizing Microsoft CRM; designed automated EFT scheduling system for daily ACH processing",
        "Designed and implemented SOAP API for business partners to interface with back-end processing system."
      ]
    },
    {
      "id": "evo-merchant",
      "title": "Senior Developer",
      "company": "Evo Merchant Services, Inc.",
      "location": "Melville, NY",
      "startDate": "2005",
      "endDate": "2007",
      "description": "Credit Card Processor",
      "achievements": [
        "Developed a multi-user credit card risk management system that was utilized by internal employees and external business partners via Citrix.",
        "Created file processors to populate the system with card transaction data from Visa, MasterCard, American Express, and Discover.",
        "Deployed card risk management system using single sign-on solution and active directory ensuring data security and integrity throughout system; reduced company losses by detecting fraudulent card activity.",
        "Developed in-house solution for managing 100K+ merchants while integrating all aspects of the business from sales to onboarding."
      ]
    },
    {
      "id": "direct-insite",
      "title": "Senior Developer",
      "company": "Direct Insite, Inc.",
      "location": "Hauppauge, NY",
      "startDate": "2004",
      "endDate": "2005",
      "description": "IBM Invoicing Company",
      "achievements": [
        "Designed a management console for Just-In-Time (JIT) processing system for rendering XML datasets with XSLT.",
        "Developed framework for JIT modules allowing programmers a common C# interface for constructing dynamic data processing applications. Created app to process real-time financial data feeds from IBM Japan.",
        ".NET/C#, SQL Server"
      ]
    },
    {
      "id": "ccsi",
      "title": "Senior Developer",
      "company": "CCSI",
      "location": "Hauppauge, NY",
      "startDate": "2002",
      "endDate": "2004",
      "description": "Technology Contractor",
      "achievements": [
        "Developed a case management system for the Suffolk County District Attorney, ingesting over 100,000 court indictments and dispositions.",
        "Established Nassau University Medical Center medical permissions program (HIPPA compliant) converting existing data into flexible browser-based application.",
        "Designed modules for a browser-based, ASP knowledge system for school districts.",
        "NET/C#, Oracle"
      ]
    },
    {
      "id": "pipelive",
      "title": "Chief Technology Officer",
      "company": "PipeLive, LLC",
      "location": "Melville, NY",
      "startDate": "1997",
      "endDate": "2002",
      "description": "Chat SaaS Software",
      "achievements": [
        "Co-founded PipeLive, LLC with the President and CEO of a large communications company. Together, we designed and developed a modular suite of real-time collaboration software. I created a development environment that allowed us to maintain, test, and debug concurrent software products. I collaborated with business partners to create new products through integration. I presented our new Web Interaction Center products at CeBIT in Germany and Inter Op in Las Vegas, NV.",
        "Received 12 industry awards including PC Magazine's Winner's Circle and TMC Labs Innovation Awards.",
        "Negotiate dotiated $2M 4-year reseller agreement with Siemens AG distributing Web Interaction Center worldwide; managed product integration with Siemens Switzerland's call center product line.",
        "Worked on early AI-based chat system with Banter, Inc. for LaSalle Bank in San Francisco, CA."
      ]
    }
  ],
  "techStack": {
    "languages": [
      "Linux", "Python", "Bash", "AWS", "C#", "Javascript", "Node JS", 
      "Snowflake", "Athena", "Learning Rust", "Some Assembly", "HTML", "Java", "PHP"
    ],
    "tools": [
      "Bind9", "FastAPI", "Nginx", "Certbot", "OpenWRT", "Jupytr", "Minio", 
      "Weaviate", "Git", "Huggingface", "Google Colab", "Generative AI", 
      "Streamlit", "Postgres", "MySQL", "PostFix", "ElasticSearch", "Redis", 
      "Apache SOLR", "Hive", "Hadoop", "MongoDB"
    ],
    "projects": [
      "Local LLMs - LLama", "Lavva", "IoT", "RaspberryPi", "ADSB", "RTLD", "TRNG", "6502"
    ]
  },
  "keyAccomplishments": [
    {
      "title": "Deploying Large Language Models",
      "description": "Deploying Large Language Models (LLMs) is a journey that every developer should go on. I recently had the opportunity to fine-tune and deploy a local LLM. It was a great learning experience, and I encourage every developer to do the same."
    },
    {
      "title": "Creating a large, cross-channel communications platform",
      "description": "Overcoming the challenges of ingesting and organizing millions of new data points per day."
    },
    {
      "title": "Leading a team of talented developers",
      "description": "I acquired the ability to drive a project forward while guiding a team of intelligent individuals toward a common goal."
    }
  ],
  "strengths": [
    {
      "title": "Full Stack",
      "description": "My primary competency is in software. However, my innate curiosity has driven me to explore the full spectrum of technology, from physics to Generative AI."
    },
    {
      "title": "Always Learning",
      "description": "I adhere to the mantra, \"One is always a student.\" This philosophy motivates me to continuously evaluate new languages and platforms."
    },
    {
      "title": "Inventor",
      "description": "Turning Generative AI into a problem solver. Developing novel tools to interface with the real world."
    }
  ],
  "education": [
    {
      "degree": "Advanced Object Oriented Programming",
      "institution": "Columbia University",
      "dateRange": "Date period"
    },
    {
      "degree": "Courses in Computer Science",
      "institution": "Plymouth State College",
      "dateRange": "Date period"
    },
    {
      "degree": "Physics Engineering",
      "institution": "University of Buffalo",
      "dateRange": "Date period"
    }
  ],
  "projects": [
    {
      "name": "CardScore",
      "description": "Crowd-driven collectible ranking platform.",
      "dateRange": "Date period",
      "location": "Location"
    },
    {
      "name": "Maho Crossroads",
      "description": "Helped startup a beach bar in the US Virgin Islands. Added off-grid telecommunications network and power systems.",
      "dateRange": "Date period",
      "location": "Location"
    },
    {
      "name": "Lovango",
      "description": "Rum Bar startup in the US Virgin Islands. Lead the team installing A/V and Networking.",
      "dateRange": "Date period",
      "location": "Location"
    }
  ],
  "references": [
    {
      "name": "Mark Hepler",
      "contact": "Phone #"
    },
    {
      "name": "Marek Mikesell",
      "contact": "Reference Contact"
    },
    {
      "name": "CJ Galdes",
      "contact": "Reference Contact"
    }
  ]
}